[
  {
    "name": "Check Inn",
    "img": "images/checkinn/checkinnfront.jpg",
    "screenshots": ["images/checkinn/img1.png","images/checkinn/img2.png"],
    "info": "Check Inn, a hotel booking system, built in Java using Swing is designed to accommodate multi-booking hotel reservations and also accommodates for checking in/out guests, editing existing bookings, printing receipts and viewing general information (earnings, system access information, staff information).",
    "windows": true,
    "iconToolTip": "Windows",
    "date": "1/04/15"
  },
  {
    "name": "Todo List",
    "img": "images/todolist/todolistfront.jpg",
    "screenshots": ["images/todolist/img1.png"],
    "info": "A fully responsive task list logging application that is available on all platforms. Built using AngularJS(1), HTML and SASS. The application allows users to add multiple lists, title lists, add individual tasks to each list, customise background images along with many other aspects. The application was developed using an agile methodology and utilizes local storage for persistence.",
    "windows": true,
    "iconToolTip": "Windows",
    "date": "1/1/16"
  },
  {
    "name": "Mod-26 Decrypter",
    "img": "images/mod26/mod26front.jpg",
    "screenshots": ["images/mod26/img2.png","images/mod26/img1.png"],
    "info": "Designed as a side project the Modulus 26 Decrypter, written in Java using swing, was developed to decipher an encryption scheme. Using two known encrypted and decrypted characters the Mod 26 Decrypter will provide the encryption and decryption map for the mapping scheme. An encrypted message can also be solved. ",
    "windows": true,
    "iconToolTip": "Windows",
    "date": "19/11/14"
  },
  {
    "name": "Pg News",
    "img": "images/pgnews/pgnewsfront.jpg",
    "screenshots": ["images/pgnews/img2.jpeg","images/pgnews/img1.jpeg"],
    "info": "Pg News is a fully customisable news reader application developed for Android and iOS using IONIC(v1). It utilises NewsApi.org, a single API that reaches out to a huge collection of news sources to enable a quick and easy jump from source to source.",
    "web": true,
    "iconToolTip": "Web Application",
    "date": "07/10/16"
  }
]
